//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.00
//    Bug Fix : 1.Show HDD smart error port number as I-SATAx, S-SATAx.
//    Reason  : 
//    Auditor : Jimmy Chiu
//    Date    : Apr/11/2017
//
//****************************************************************************
/**
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
*/

/** @file HddSMART.uni
    Uni File of HddSMART Driver

**/
//---------------------------------------------------------------------------

#include "VFR.uni"

//---------------------------------------------------------------------------

#langdef    x-AMI "x-AMI"    // AMI Configuration Language

#string STR_SMART_FAILURE           #language eng "S.M.A.R.T Status Bad, Backup and Replace."
#string STR_SMART_FAILURE_PROMPT    #language eng "Press F1 to Resume..."

#string STR_SMART_PORT              #language eng "Port"
#string STR_SMART_ISATA             #language eng "I-SATA"
#string STR_SMART_SSATA             #language eng "S-SATA"

#string STR_PRIMARY                 #language eng "Primary"
#string STR_SECONDARY               #language eng "Secondary"
#string STR_MASTER                  #language eng "Master"
#string STR_SLAVE                   #language eng "Slave"

#string STR_SMART_FORM              #language eng "SMART Settings"
#string STR_SMART_FORM_HELP         #language eng "System SMART Settings"
#string STR_SMART_SELFTEST          #language eng "SMART Self Test"
                                    #language x-AMI "HSMA000"
#string STR_SMART_SELFTEST_HELP     #language eng "Run SMART Self Test on all HDDs during POST."

/**
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
*/
